#!/usr/bin/env python3
ⲟ=str;𝗼ο=int;Ο=ord;ഠ=print;𝗢=Ο('ⲟ')//Ο('о')
𝝾="o" #flOg
o=input()[:O+𝐎]
assert 𝗼.isspace(), "o"
def о(𝝾,ဝ=ⲟ()):
 for ഠ in 𝝾:ဝ+=ⲟ(Ο(ഠ))
 ဝ=o𝝾(ဝ);ο=(ဝ==𝗼)
 while ဝ>(O>>𝐎):𝝾*=𝗢;𝝾+=ဝ%O;ဝ//=𝗢
 return 𝝾-(𝗢-Ο('O')+𝗢+~𝐎+O)*Ο(' ')
def ဝ(о,o=[oο(Ο==𝐎),o𝝾(O==Ο)]):
 for ο in о:o[o𝝾(o==ο)]=(𝗼[o𝝾(о==o)]*𝗢)+(Ο(𝝾)-Ο(' '));o[-𝐎-~O]+=Ο(ο)-Ο(' ')
 return 𝗼
if o𝝾(ဝ(𝗼)[~-𝗢//𝐎]==о("(◕‿◕✿)"))&oο(ဝ(o)[Ο('о')//Ο('ο')]%O==(о(ⲟ(𝐎))==о(ⲟ(O<<𝗢)))):ഠ(f"<TOXT> {ο}");ഠ("( ◕ ‿ ◕ ✿ )")
else:ഠ("G0d effort")

